<details ><summary>plan for core 2024-12-15 05:49:20 (UTC)</summary>
  <details open="true"><summary>Plan output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudflare_dns_record.renterd will be created
  + resource "cloudflare_dns_record" "renterd" {
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "renterd.test-node.testing.pinner.xyz"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "594c7058710c206292951980b32a4881"
    }

  # cloudflare_dns_record.renterd_s3 will be created
  + resource "cloudflare_dns_record" "renterd_s3" {
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "s3.renterd.test-node.testing.pinner.xyz"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "594c7058710c206292951980b32a4881"
    }

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = []
        }
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = []
        }
    }

  # module.renterd.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = []
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + etcd_endpoint       = (known after apply)
  + etcd_password       = (sensitive value)
  + mysql_endpoint      = (known after apply)
  + renterd_endpoint    = "renterd.test-node.testing.pinner.xyz"
  + renterd_s3_endpoint = "s3.renterd.test-node.testing.pinner.xyz"

─────────────────────────────────────────────────────────────────────────────
```
</details>
</details>